cases/cfd/fluids/flatplate_zpg_subsonic/solution/case/system/ForceCoeffs
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object ForceCoeffs;
}
type forceCoeffs;
libs (forces);
patches (wall);
rho rhoInf;
rhoInf 1.0;
magUInf 1.0;
lRef 2.0;
Aref 2.0;
liftDir (0 1 0);
dragDir (1 0 0);
CofR (0 0 0);
pitchAxis (0 0 1);
writeControl timeStep;
writeInterval 1;
