cases/cfd/fluids/flatplate_zpg_subsonic/solution/case/system/WallShear
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object WallShear;
}
type wallShearStress;
libs (fieldFunctionObjects);
patches (wall);
writeControl timeStep;
writeFields true;
