cases/cfd/fluids/flatplate_zpg_subsonic/solution/case/system/WallSurface
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object WallSurface;
}
type surfaces;
libs (sampling);
interpolationScheme cellPoint;
surfaceFormat raw;
fields (wallShearStress);
surfaces
{
    wallSurface
    {
        type patch;
        patches (wall);
        interpolate false;
    }
}
