cases/cfd/fluids/flatplate_zpg_subsonic/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
// A CAP, not the stopping rule. `residualControl` in fvSolution is what stops
// this run: it is first met at iteration 1641 on the domain image (measured on
// this case's own shipped mesh, #286), and the cap sits above twice that. It
// used to be 3000, which this case did converge under -- by 1.83x, on one
// host. That is not a margin. The iteration count is not a constant of the
// case: GAMG agglomeration and the linear-solver path move it between OpenFOAM
// builds, and `lid_driven_cavity_ghia_re100` is what the same margin looks like
// once it goes negative -- it stopped on its cap for its whole life with
// nothing recording that it had (#266, #273). Raising the cap changes no
// number here: re-measured at 4000, the run still stops at the same 1641
// iterations with the same reported value.
endTime         4000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;             // writes the volVectorField to time dirs
        patches         (wall);
    }

    // Sample wallShearStress on the wall patch to a .raw file that has
    // per-face (x y z tau_x tau_y tau_z). Needed to extract C_f(x=0.97).
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress);
        surfaces
        {
            wallSurface
            {
                type    patch;
                patches (wall);
                interpolate false;
            }
        }
    }

    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   50;

        patches         (wall);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1;
        lRef            2;       // plate length
        Aref            2;       // plate length * unit-span width (z-thickness=1)

        // Bin drag along x so Cf(x) can be recovered: local Cf = bin_Cd * nBin
        binData
        {
            nBin        200;
            direction   (1 0 0);
            cumulative  false;
        }
    }
}
