cases/cfd/fluids/flatplate_zpg_subsonic/solution/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    residualControl
    {
        p               1e-5;
        U               1e-5;
        k               1e-5;
        omega           1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.9;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}
